
&НаСервере
Процедура ЗаполнитьЕжедневнымиТратамиНаСервере()
	
	Объект.Расходы.Очистить();
	СуммаВДень = Константы.РасходыНаПроживаниеВДень.Получить();
	ДатаНачала = НачалоМесяца(Объект.Месяц);
	ДатаЗавершения = КонецМесяца(Объект.Месяц);
	ДатаВТаблицу = ДатаНачала;
	СекундВДне = 24*60*60;
	Пока ДатаВТаблицу <= ДатаЗавершения Цикл
		СтрокаРасхода = ОБъект.Расходы.Добавить();
		СтрокаРасхода.Дата = ДатаВТаблицу;
		СтрокаРасхода.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ЕжедневныеРасходыНаПроживание;
		СтрокаРасхода.Сумма = СуммаВДень;
		ДатаВТаблицу = ДатаВТаблицу + СекундВДне;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕжедневнымиТратами(Команда)
	ЗаполнитьЕжедневнымиТратамиНаСервере();
КонецПроцедуры
