#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДельтуСуммДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	МесяцПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовТаблицыФормыПоступления

&НаКлиенте
Процедура ПоступленияСуммаПриИзменении(Элемент)
	ПоступленияСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияСуммаФактПриИзменении(Элемент)
	ПоступленияСуммаФактПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкорректироватьДаты(Команда)
	
	СкорректироватьДатыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Процедура МесяцПриИзмененииНаСервере()
	
	СкорректироватьДатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СкорректироватьДатыНаСервере()
	
	ДанныеОбъекта = РеквизитФормыВЗначение("Объект");
	ЗаполнениеДокументовВызовСервера.СкорректироватьДатыНаСервере(Объект.Месяц, ДанныеОбъекта.Поступления, Модифицированность);
	ЗначениеВРеквизитФормы(ДанныеОбъекта, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПоступленияСуммаФактПриИзмененииНаСервере()
	
	Объект.СуммаДокументаФакт = Объект.Поступления.Итог("СуммаФакт");
	ОбновитьДельтуСуммДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПоступленияСуммаПриИзмененииНаСервере()
	
	Объект.СуммаДокументаПлан = Объект.Поступления.Итог("СуммаПлан");
	ОбновитьДельтуСуммДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДельтуСуммДокумента()
	
	ДельтаПланФакт = Объект.СуммаДокументаПлан - Объект.СуммаДокументаФакт;
	
КонецПроцедуры

#КонецОбласти 
