
&НаСервереБезКонтекста
Процедура ТестоваяИнтеграцияНаСервере()

	Прокси = WSСсылки.WSdrebedengi.СоздатьWSПрокси("https://www.drebedengi.ru/", "ddengiService", "SoapPort");
	
	////Создаем прокси для обращения к внешнему веб-сервису,
	//// передаем в функцию URI пространства имен, имя сервиса, имя порта.
	//Прокси = WSСсылки.CBR_DailyInfoWebServ.СоздатьWSПрокси(
	//                                     "https://www.drebedengi.ru/", "ddengiService", "SoapPort");
	//
	////Получаем тип параметра, который передается в метод GetCursOnDate.
	//ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(
	//                                    "http://web.cbr.ru/").Получить("GetCursOnDate");
	////Создаем параметр на основе типа и заполняем значение параметра On_Date.
	//WSПараметр  = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	//WSПараметр.On_Date= фДатаЗагрузки;
	//
	////Вызываем метод веб-сервиса, записываем результат в переменную КурсыВалют.
	//КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	//
	////Перебираем таблицу ValuteCursOnDate, каждое значение таблицы
	//// добавляем в таблицу на форме (колонки заполняем соответствующими значениями).
	//Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
	//    НоваяСтрокаТЗ = ТаблицаКурсовВалют.Добавить();
	//    НоваяСтрокаТЗ.НазваниеВалюты      = Элемент.Vname;
	//    НоваяСтрокаТЗ.Номинал             = Элемент.Vnom;
	//    НоваяСтрокаТЗ.ЦифровойКодВалюты   = Элемент.Vcode;
	//    НоваяСтрокаТЗ.СимвольныйКодВалюты = Элемент.VChCode;
	//    НоваяСтрокаТЗ.КурсВалюты          = Элемент.Vcurs;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТестоваяИнтеграция(Команда)
	ТестоваяИнтеграцияНаСервере();
КонецПроцедуры
